app/Models/M_kantor.php

SELECT *
FROM `tbl_kantor`
---
    public function get_all_data()
    {
        return $this->db->table('tbl_kantor')->get()->getResultArray();